app/views/posts/show.html.erb

<!-- Comments appear here -->
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 14]]