app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Thread#2"], ["description", "Content placeholder."], ["created_at", "2017-07-19 17:36:13.108265"], ["updated_at", "2017-07-19 17:36:13.108265"]]
---
	def create
		@post = current_user.posts.build(post_params)
		if @post.save