EunixBootstrap/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["post_id", 2], ["user_id", 2], ["created_at", "2017-07-20 22:10:40.820484"], ["updated_at", "2017-07-20 22:10:40.820484"]]
---
	def create
			@comment = @post.comments.create(comment_params)

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Buy some and take these cards off my hands please"], ["updated_at", "2017-07-20 22:15:30.312740"], ["id", 4]]
---
	def update
		if @comment.update(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def find_post
		@post = Post.find(params[:post_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 2], ["id", 4], ["LIMIT", 1]]
---
	def find_comment
		@comment = @post.comments.find(params[:id])